grodansparadis/vscp-firmware/pic/common/PIC18_ECAN/p18f2680_mod.h
extern volatile far  unsigned char       RXF11EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} RXF11EIDLbits;
extern volatile far  unsigned char       RXF12SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} RXF12SIDHbits;
extern volatile far  unsigned char       RXF12SIDL;
extern volatile far  struct {
  unsigned EID16:1;
  unsigned EID17:1;
  unsigned :1;
  unsigned EXIDE:1;
  unsigned :1;
  unsigned SID0:1;
  unsigned SID1:1;
  unsigned SID2:1;
} RXF12SIDLbits;
extern volatile far  unsigned char       RXF12EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} RXF12EIDHbits;
extern volatile far  unsigned char       RXF12EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} RXF12EIDLbits;
extern volatile far  unsigned char       RXF13SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} RXF13SIDHbits;
extern volatile far  unsigned char       RXF13SIDL;
extern volatile far  struct {
  unsigned EID16:1;
  unsigned EID17:1;
  unsigned :1;
  unsigned EXIDE:1;
  unsigned :1;
  unsigned SID0:1;
  unsigned SID1:1;
  unsigned SID2:1;
} RXF13SIDLbits;
extern volatile far  unsigned char       RXF13EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} RXF13EIDHbits;
extern volatile far  unsigned char       RXF13EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} RXF13EIDLbits;
extern volatile far  unsigned char       RXF14SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} RXF14SIDHbits;
extern volatile far  unsigned char       RXF14SIDL;
extern volatile far  struct {
  unsigned EID16:1;
  unsigned EID17:1;
  unsigned :1;
  unsigned EXIDE:1;
  unsigned :1;
  unsigned SID0:1;
  unsigned SID1:1;
  unsigned SID2:1;
} RXF14SIDLbits;
extern volatile far  unsigned char       RXF14EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} RXF14EIDHbits;
extern volatile far  unsigned char       RXF14EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} RXF14EIDLbits;
extern volatile far  unsigned char       RXF15SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} RXF15SIDHbits;
extern volatile far  unsigned char       RXF15SIDL;
extern volatile far  struct {
  unsigned EID16:1;
  unsigned EID17:1;
  unsigned :1;
  unsigned EXIDE:1;
  unsigned :1;
  unsigned SID0:1;
  unsigned SID1:1;
  unsigned SID2:1;
} RXF15SIDLbits;
extern volatile far  unsigned char       RXF15EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} RXF15EIDHbits;
extern volatile far  unsigned char       RXF15EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} RXF15EIDLbits;
extern volatile far  unsigned char       RXFCON0;
extern volatile far  struct {
  unsigned RXF0EN:1;
  unsigned RXF1EN:1;
  unsigned RXF2EN:1;
  unsigned RXF3EN:1;
  unsigned RXF4EN:1;
  unsigned RXF5EN:1;
  unsigned RXF6EN:1;
  unsigned RXF7EN:1;
} RXFCON0bits;
extern volatile far  unsigned char       RXFCON1;
extern volatile far  struct {
  unsigned RXF8EN:1;
  unsigned RXF9EN:1;
  unsigned RXF10EN:1;
  unsigned RXF11EN:1;
  unsigned RXF12EN:1;
  unsigned RXF13EN:1;
  unsigned RXF14EN:1;
  unsigned RXF15EN:1;
} RXFCON1bits;
extern volatile far  unsigned char       SDFLC;
extern volatile far  struct {
  unsigned DFLC0:1;
  unsigned DFLC1:1;
  unsigned DFLC2:1;
  unsigned DFLC3:1;
  unsigned DFLC4:1;
} SDFLCbits;
extern volatile far  unsigned char       RXFBCON0;
extern volatile far  struct {
  unsigned F0BP_0:1;
  unsigned F0BP_1:1;
  unsigned F0BP_2:1;
  unsigned F0BP_3:1;
  unsigned F1BP_0:1;
  unsigned F1BP_1:1;
  unsigned F1BP_2:1;
  unsigned F1BP_3:1;
} RXFBCON0bits;
extern volatile far  unsigned char       RXFBCON1;
extern volatile far  struct {
  unsigned F2BP_0:1;
  unsigned F2BP_1:1;
  unsigned F2BP_2:1;
  unsigned F2BP_3:1;
  unsigned F3BP_0:1;
  unsigned F3BP_1:1;
  unsigned F3BP_2:1;
  unsigned F3BP_3:1;
} RXFBCON1bits;
extern volatile far  unsigned char       RXFBCON2;
extern volatile far  struct {
  unsigned F4BP_0:1;
  unsigned F4BP_1:1;
  unsigned F4BP_2:1;
  unsigned F4BP_3:1;
  unsigned F5BP_0:1;
  unsigned F5BP_1:1;
  unsigned F5BP_2:1;
  unsigned F5BP_3:1;
} RXFBCON2bits;
extern volatile far  unsigned char       RXFBCON3;
extern volatile far  struct {
  unsigned F6BP_0:1;
  unsigned F6BP_1:1;
  unsigned F6BP_2:1;
  unsigned F6BP_3:1;
  unsigned F7BP_0:1;
  unsigned F7BP_1:1;
  unsigned F7BP_2:1;
  unsigned F7BP_3:1;
} RXFBCON3bits;
extern volatile far  unsigned char       RXFBCON4;
extern volatile far  struct {
  unsigned F8BP_0:1;
  unsigned F8BP_1:1;
  unsigned F8BP_2:1;
  unsigned F8BP_3:1;
  unsigned F9BP_0:1;
  unsigned F9BP_1:1;
  unsigned F9BP_2:1;
  unsigned F9BP_3:1;
} RXFBCON4bits;
