grodansparadis/vscp-firmware/pic/common/PIC18_ECAN/p18f2680_mod.h
extern volatile far  unsigned char       B2D1;
extern volatile far  struct {
  unsigned B2D10:1;
  unsigned B2D11:1;
  unsigned B2D12:1;
  unsigned B2D13:1;
  unsigned B2D14:1;
  unsigned B2D15:1;
  unsigned B2D16:1;
  unsigned B2D17:1;
} B2D1bits;
extern volatile far  unsigned char       B2D2;
extern volatile far  struct {
  unsigned B2D20:1;
  unsigned B2D21:1;
  unsigned B2D22:1;
  unsigned B2D23:1;
  unsigned B2D24:1;
  unsigned B2D25:1;
  unsigned B2D26:1;
  unsigned B2D27:1;
} B2D2bits;
extern volatile far  unsigned char       B2D3;
extern volatile far  struct {
  unsigned B2D30:1;
  unsigned B2D31:1;
  unsigned B2D32:1;
  unsigned B2D33:1;
  unsigned B2D34:1;
  unsigned B2D35:1;
  unsigned B2D36:1;
  unsigned B2D37:1;
} B2D3bits;
extern volatile far  unsigned char       B2D4;
extern volatile far  struct {
  unsigned B2D40:1;
  unsigned B2D41:1;
  unsigned B2D42:1;
  unsigned B2D43:1;
  unsigned B2D44:1;
  unsigned B2D45:1;
  unsigned B2D46:1;
  unsigned B2D47:1;
} B2D4bits;
extern volatile far  unsigned char       B2D5;
extern volatile far  struct {
  unsigned B2D50:1;
  unsigned B2D51:1;
  unsigned B2D52:1;
  unsigned B2D53:1;
  unsigned B2D54:1;
  unsigned B2D55:1;
  unsigned B2D56:1;
  unsigned B2D57:1;
} B2D5bits;
extern volatile far  unsigned char       B2D6;
extern volatile far  struct {
  unsigned B2D60:1;
  unsigned B2D61:1;
  unsigned B2D62:1;
  unsigned B2D63:1;
  unsigned B2D64:1;
  unsigned B2D65:1;
  unsigned B2D66:1;
  unsigned B2D67:1;
} B2D6bits;
extern volatile far  unsigned char       B2D7;
extern volatile far  struct {
  unsigned B2D70:1;
  unsigned B2D71:1;
  unsigned B2D72:1;
  unsigned B2D73:1;
  unsigned B2D74:1;
  unsigned B2D75:1;
  unsigned B2D76:1;
  unsigned B2D77:1;
} B2D7bits;
extern volatile far  unsigned char       CANSTAT_RO7;
extern volatile far  struct {
  unsigned ICODE0:1;
  unsigned ICODE1:1;
  unsigned ICODE2:1;
  unsigned ICODE3:1;
  unsigned ICODE4:1;
  unsigned OPMODE:1;
  unsigned REQOP1:1;
  unsigned REQOP2:1;
} CANSTAT_RO7bits;
extern volatile far  unsigned char       CANCON_RO7;
extern volatile far  struct {
  unsigned :1;
  unsigned WIN0:1;
  unsigned WIN1:1;
  unsigned WIN2:1;
  unsigned ABAT:1;
  unsigned REQOP0:1;
  unsigned REQOP1:1;
  unsigned REQOP2:1;
} CANCON_RO7bits;
extern volatile far  unsigned char       B3CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
} B3CONbits;
extern volatile far  unsigned char       B3SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} B3SIDHbits;
extern volatile far  unsigned char       B3SIDL;
extern volatile far  union {
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :1;
    unsigned EXID:1;
    unsigned SRR:1;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
  struct {
    unsigned :3;
    unsigned EXIDE:1;
  };
} B3SIDLbits;
extern volatile far  unsigned char       B3EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} B3EIDHbits;
extern volatile far  unsigned char       B3EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} B3EIDLbits;
extern volatile far  unsigned char       B3DLC;
extern volatile far  union {
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RESRB0:1;
    unsigned RESRB1:1;
    unsigned RXRTR:1;
  };
  struct {
    unsigned :6;
    unsigned TXRTR:1;
  };
} B3DLCbits;
extern volatile far  unsigned char       B3D0;
extern volatile far  struct {
  unsigned B3D00:1;
  unsigned B3D01:1;
  unsigned B3D02:1;
  unsigned B3D03:1;
  unsigned B3D04:1;
  unsigned B3D05:1;
  unsigned B3D06:1;
  unsigned B3D07:1;
} B3D0bits;
extern volatile far  unsigned char       B3D1;
extern volatile far  struct {
  unsigned B3D10:1;
  unsigned B3D11:1;
  unsigned B3D12:1;
  unsigned B3D13:1;
  unsigned B3D14:1;
  unsigned B3D15:1;
  unsigned B3D16:1;
  unsigned B3D17:1;
} B3D1bits;
extern volatile far  unsigned char       B3D2;
extern volatile far  struct {
  unsigned B3D20:1;
  unsigned B3D21:1;
  unsigned B3D22:1;
  unsigned B3D23:1;
  unsigned B3D24:1;
  unsigned B3D25:1;
  unsigned B3D26:1;
  unsigned B3D27:1;
} B3D2bits;
extern volatile far  unsigned char       B3D3;
extern volatile far  struct {
  unsigned B3D30:1;
  unsigned B3D31:1;
  unsigned B3D32:1;
  unsigned B3D33:1;
  unsigned B3D34:1;
  unsigned B3D35:1;
  unsigned B3D36:1;
  unsigned B3D37:1;
} B3D3bits;
extern volatile far  unsigned char       B3D4;
extern volatile far  struct {
  unsigned B3D40:1;
  unsigned B3D41:1;
  unsigned B3D42:1;
  unsigned B3D43:1;
  unsigned B3D44:1;
  unsigned B3D45:1;
  unsigned B3D46:1;
  unsigned B3D47:1;
} B3D4bits;
extern volatile far  unsigned char       B3D5;
extern volatile far  struct {
  unsigned B3D50:1;
  unsigned B3D51:1;
  unsigned B3D52:1;
  unsigned B3D53:1;
  unsigned B3D54:1;
  unsigned B3D55:1;
  unsigned B3D56:1;
  unsigned B3D57:1;
} B3D5bits;
extern volatile far  unsigned char       B3D6;
extern volatile far  struct {
  unsigned B3D60:1;
  unsigned B3D61:1;
  unsigned B3D62:1;
  unsigned B3D63:1;
  unsigned B3D64:1;
  unsigned B3D65:1;
  unsigned B3D66:1;
  unsigned B3D67:1;
} B3D6bits;
extern volatile far  unsigned char       B3D7;
extern volatile far  struct {
  unsigned B3D70:1;
  unsigned B3D71:1;
  unsigned B3D72:1;
  unsigned B3D73:1;
  unsigned B3D74:1;
  unsigned B3D75:1;
  unsigned B3D76:1;
  unsigned B3D77:1;
} B3D7bits;
extern volatile far  unsigned char       CANSTAT_RO6;
extern volatile far  struct {
  unsigned ICODE0:1;
  unsigned ICODE1:1;
  unsigned ICODE2:1;
  unsigned ICODE3:1;
  unsigned ICODE4:1;
  unsigned OPMODE:1;
  unsigned REQOP1:1;
  unsigned REQOP2:1;
} CANSTAT_RO6bits;
extern volatile far  unsigned char       CANCON_RO6;
extern volatile far  struct {
  unsigned :1;
  unsigned WIN0:1;
  unsigned WIN1:1;
  unsigned WIN2:1;
  unsigned ABAT:1;
  unsigned REQOP0:1;
  unsigned REQOP1:1;
  unsigned REQOP2:1;
} CANCON_RO6bits;
extern volatile far  unsigned char       B4CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
} B4CONbits;
